<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#DataFrame对象的选择-索引-和切片" data-toc-modified-id="DataFrame对象的选择-索引-和切片-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>DataFrame对象的选择 索引 和切片</a></span><ul class="toc-item"><li><span><a href="#选择列df[列名]" data-toc-modified-id="选择列df[列名]-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>选择列df[列名]</a></span></li><li><span><a href="#选择行df[开始位置：终止位置:步长和方向]" data-toc-modified-id="选择行df[开始位置：终止位置:步长和方向]-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>选择行df[开始位置：终止位置:步长和方向]</a></span></li><li><span><a href="#df.loc[]基于标签的索引(显示索引)" data-toc-modified-id="df.loc[]基于标签的索引(显示索引)-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>df.loc[]基于标签的索引(显示索引)</a></span><ul class="toc-item"><li><span><a href="#索引行df.loc[行,-:]" data-toc-modified-id="索引行df.loc[行,-:]-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span>索引行df.loc[行, :]</a></span></li><li><span><a href="#索引列df.loc[:,-列名]" data-toc-modified-id="索引列df.loc[:,-列名]-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>索引列df.loc[:, 列名]</a></span></li><li><span><a href="#切片行df.loc[行1:行2:步长和方向]" data-toc-modified-id="切片行df.loc[行1:行2:步长和方向]-1.3.3"><span class="toc-item-num">1.3.3&nbsp;&nbsp;</span>切片行df.loc[行1:行2:步长和方向]</a></span></li><li><span><a href="#切片列df.loc[:,-列1-:列2-:-步长和方向]" data-toc-modified-id="切片列df.loc[:,-列1-:列2-:-步长和方向]-1.3.4"><span class="toc-item-num">1.3.4&nbsp;&nbsp;</span>切片列df.loc[:, 列1 :列2 : 步长和方向]</a></span></li><li><span><a href="#切片一部分df.loc[行1:行2,-列1:列2]" data-toc-modified-id="切片一部分df.loc[行1:行2,-列1:列2]-1.3.5"><span class="toc-item-num">1.3.5&nbsp;&nbsp;</span>切片一部分df.loc[行1:行2, 列1:列2]</a></span></li><li><span><a href="#特殊用法，-用来增加行" data-toc-modified-id="特殊用法，-用来增加行-1.3.6"><span class="toc-item-num">1.3.6&nbsp;&nbsp;</span>特殊用法， 用来增加行</a></span></li></ul></li><li><span><a href="#df.iloc[]基于位置的索引（隐式索引）(选讲)" data-toc-modified-id="df.iloc[]基于位置的索引（隐式索引）(选讲)-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>df.iloc[]基于位置的索引（隐式索引）(选讲)</a></span><ul class="toc-item"><li><span><a href="#索引行df.iloc[位置,-:]" data-toc-modified-id="索引行df.iloc[位置,-:]-1.4.1"><span class="toc-item-num">1.4.1&nbsp;&nbsp;</span>索引行df.iloc[位置, :]</a></span></li><li><span><a href="#索引列df.iloc[:,-位置]" data-toc-modified-id="索引列df.iloc[:,-位置]-1.4.2"><span class="toc-item-num">1.4.2&nbsp;&nbsp;</span>索引列df.iloc[:, 位置]</a></span></li><li><span><a href="#切片一部分df.iloc[位置1：位置2,-行1：行2]" data-toc-modified-id="切片一部分df.iloc[位置1：位置2,-行1：行2]-1.4.3"><span class="toc-item-num">1.4.3&nbsp;&nbsp;</span>切片一部分df.iloc[位置1：位置2, 行1：行2]</a></span></li></ul></li></ul></li></ul></div>

In [1]:
#全部行都能输出
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [149]:
import numpy as np
import pandas as pd

**索引/选择的基本语法如下：**

| 实现目的 | 语法 | 结果 |    
|----------|------|------|  
| 选择列  | df[col] |Series| 
| 切片行 | df[5:10] |DataFrame |  
| 按标签选择行| df.loc[label]| Series |  
| 按位置选择行| df.iloc[loc] | Series |   
| 按布尔向量选择行 | df[bool_vec] | DataFrame|

# DataFrame对象的选择 索引 和切片

## 选择列df[列名]  
如果需要选择多个列， 则列名需要以列表的形式给出

In [150]:
df = pd.DataFrame({'姓名': ['小明', '小高', '小红', '小张'],
                   '性别': ['男', '男', '女', '男'], 
                   '基本工资': [3500, 4500, 5000, 5000], 
                   '销售业绩': [10000, 15000, 20000, 1500], 
                   '业绩提成=销售业绩x10%': [1000, 1500, 2000,  1500]})
df

   姓名 性别  基本工资   销售业绩  业绩提成=销售业绩x10%
0  小明  男  3500  10000           1000
1  小高  男  4500  15000           1500
2  小红  女  5000  20000           2000
3  小张  男  5000   1500           1500

In [151]:
df['姓名']  # 单独的提取一列是Series对象

0    小明
1    小高
2    小红
3    小张
Name: 姓名, dtype: object

In [152]:
df['基本工资']

0    3500
1    4500
2    5000
3    5000
Name: 基本工资, dtype: int64

In [153]:
df[['姓名', '基本工资']] # 提取两列及以上返回的是一个DataFrame对象

   姓名  基本工资
0  小明  3500
1  小高  4500
2  小红  5000
3  小张  5000

**选取多列的时候记得一定要以列表的形式存储起来**

## 选择行df[开始位置：终止位置:步长和方向]  
注意不能单独的写一个进行索引  
终止位置取不到

In [154]:
df

   姓名 性别  基本工资   销售业绩  业绩提成=销售业绩x10%
0  小明  男  3500  10000           1000
1  小高  男  4500  15000           1500
2  小红  女  5000  20000           2000
3  小张  男  5000   1500           1500

In [155]:
df[0:1]

   姓名 性别  基本工资   销售业绩  业绩提成=销售业绩x10%
0  小明  男  3500  10000           1000

In [156]:
df[2:3]

   姓名 性别  基本工资   销售业绩  业绩提成=销售业绩x10%
2  小红  女  5000  20000           2000

In [157]:
df[-1::-1]  # 倒着取

   姓名 性别  基本工资   销售业绩  业绩提成=销售业绩x10%
3  小张  男  5000   1500           1500
2  小红  女  5000  20000           2000
1  小高  男  4500  15000           1500
0  小明  男  3500  10000           1000

**如果我们有自己设置的索引， 也是可以的**

In [163]:
df1 = df.copy()
df1

   姓名 性别  基本工资   销售业绩  业绩提成=销售业绩x10%
0  小明  男  3500  10000           1000
1  小高  男  4500  15000           1500
2  小红  女  5000  20000           2000
3  小张  男  5000   1500           1500

In [164]:
df1.set_index('姓名', inplace=True)

In [165]:
df1

   性别  基本工资   销售业绩  业绩提成=销售业绩x10%
姓名
小明  男  3500  10000           1000
小高  男  4500  15000           1500
小红  女  5000  20000           2000
小张  男  5000   1500           1500

我们按姓名来进行索引

In [166]:
df1['小明':'小红']  # 这种情况下， 终止位置能取

   性别  基本工资   销售业绩  业绩提成=销售业绩x10%
姓名
小明  男  3500  10000           1000
小高  男  4500  15000           1500
小红  女  5000  20000           2000

**这种情况下， 终止位置能取**

## df.loc[]基于标签的索引(显示索引)

基于标签索引的基本语法 : **df.loc[行索引,列索引]**

**逗号之前是切取的行信息,逗号之后是切取的列信息**

只切取行信息返回所有列信息的时候,列索引和逗号可以省略

只切取列信息返回所有行信息的时候,行索引和冒号不能省略,用冒号表示切取所有行.

In [167]:
df

   姓名 性别  基本工资   销售业绩  业绩提成=销售业绩x10%
0  小明  男  3500  10000           1000
1  小高  男  4500  15000           1500
2  小红  女  5000  20000           2000
3  小张  男  5000   1500           1500

In [168]:
df2 = df.set_index('姓名')

In [169]:
df2

   性别  基本工资   销售业绩  业绩提成=销售业绩x10%
姓名
小明  男  3500  10000           1000
小高  男  4500  15000           1500
小红  女  5000  20000           2000
小张  男  5000   1500           1500

### 索引行df.loc[行, :]  
取多个行用列表给出

In [170]:
df2.loc['小明', :]    # 取0这一行， 所有列

性别                   男
基本工资              3500
销售业绩             10000
业绩提成=销售业绩x10%     1000
Name: 小明, dtype: object

In [171]:
df2.loc[['小明', '小张'], :]

   性别  基本工资   销售业绩  业绩提成=销售业绩x10%
姓名
小明  男  3500  10000           1000
小张  男  5000   1500           1500

### 索引列df.loc[:, 列名]  
取多列用列表给出

In [172]:
df2.loc[:, '业绩提成=销售业绩x10%']  # :代表去所有行

姓名
小明    1000
小高    1500
小红    2000
小张    1500
Name: 业绩提成=销售业绩x10%, dtype: int64

In [173]:
df2.loc[:, ['基本工资', '业绩提成=销售业绩x10%']]

    基本工资  业绩提成=销售业绩x10%
姓名
小明  3500           1000
小高  4500           1500
小红  5000           2000
小张  5000           1500

### 切片行df.loc[行1:行2:步长和方向]

In [174]:
df2.loc['小明':'小红']

   性别  基本工资   销售业绩  业绩提成=销售业绩x10%
姓名
小明  男  3500  10000           1000
小高  男  4500  15000           1500
小红  女  5000  20000           2000

In [175]:
df2.loc['小明':'小红':2]

   性别  基本工资   销售业绩  业绩提成=销售业绩x10%
姓名
小明  男  3500  10000           1000
小红  女  5000  20000           2000

### 切片列df.loc[:, 列1 :列2 : 步长和方向]

In [176]:
df2

   性别  基本工资   销售业绩  业绩提成=销售业绩x10%
姓名
小明  男  3500  10000           1000
小高  男  4500  15000           1500
小红  女  5000  20000           2000
小张  男  5000   1500           1500

In [177]:
df2.loc[:, '基本工资':'业绩提成=销售业绩x10%']

    基本工资   销售业绩  业绩提成=销售业绩x10%
姓名
小明  3500  10000           1000
小高  4500  15000           1500
小红  5000  20000           2000
小张  5000   1500           1500

In [178]:
df2.loc[:, '业绩提成=销售业绩x10%':'性别':-2]

    业绩提成=销售业绩x10%  基本工资
姓名
小明           1000  3500
小高           1500  4500
小红           2000  5000
小张           1500  5000

### 切片一部分df.loc[行1:行2, 列1:列2]

In [179]:
df

   姓名 性别  基本工资   销售业绩  业绩提成=销售业绩x10%
0  小明  男  3500  10000           1000
1  小高  男  4500  15000           1500
2  小红  女  5000  20000           2000
3  小张  男  5000   1500           1500

In [180]:
df.loc[0:2, '基本工资':'业绩提成=销售业绩x10%']

   基本工资   销售业绩  业绩提成=销售业绩x10%
0  3500  10000           1000
1  4500  15000           1500
2  5000  20000           2000

### 特殊用法， 用来增加行

In [181]:
df

   姓名 性别  基本工资   销售业绩  业绩提成=销售业绩x10%
0  小明  男  3500  10000           1000
1  小高  男  4500  15000           1500
2  小红  女  5000  20000           2000
3  小张  男  5000   1500           1500

In [183]:
df.loc[4] = [1, 2, 3, 4, 5]

In [184]:
df

   姓名 性别  基本工资   销售业绩  业绩提成=销售业绩x10%
0  小明  男  3500  10000           1000
1  小高  男  4500  15000           1500
2  小红  女  5000  20000           2000
3  小张  男  5000   1500           1500
4   1  2     3      4              5

In [185]:
df.loc['哈哈'] = [1, 1, 1, 1, 1]

In [186]:
df

    姓名 性别  基本工资   销售业绩  业绩提成=销售业绩x10%
0   小明  男  3500  10000           1000
1   小高  男  4500  15000           1500
2   小红  女  5000  20000           2000
3   小张  男  5000   1500           1500
4    1  2     3      4              5
哈哈   1  1     1      1              1

## df.iloc[]基于位置的索引（隐式索引）(选讲)

**隐式索引的用法基本和显示一致， 区别在于一个用的位置， 一个用的标签而已。**

In [187]:
df2

   性别  基本工资   销售业绩  业绩提成=销售业绩x10%
姓名
小明  男  3500  10000           1000
小高  男  4500  15000           1500
小红  女  5000  20000           2000
小张  男  5000   1500           1500

### 索引行df.iloc[位置, :]  
多个位置用列表给出

In [188]:
df2.iloc[2, :]

性别                   女
基本工资              5000
销售业绩             20000
业绩提成=销售业绩x10%     2000
Name: 小红, dtype: object

In [189]:
df2.iloc[[2, 3], :]

   性别  基本工资   销售业绩  业绩提成=销售业绩x10%
姓名
小红  女  5000  20000           2000
小张  男  5000   1500           1500

### 索引列df.iloc[:, 位置]  
多个位置用列表的形式给出

In [190]:
df2

   性别  基本工资   销售业绩  业绩提成=销售业绩x10%
姓名
小明  男  3500  10000           1000
小高  男  4500  15000           1500
小红  女  5000  20000           2000
小张  男  5000   1500           1500

In [191]:
df2.iloc[:, 1]

姓名
小明    3500
小高    4500
小红    5000
小张    5000
Name: 基本工资, dtype: int64

In [192]:
df2.iloc[:, [1, 3]]

    基本工资  业绩提成=销售业绩x10%
姓名
小明  3500           1000
小高  4500           1500
小红  5000           2000
小张  5000           1500

### 切片一部分df.iloc[位置1：位置2, 行1：行2]

In [193]:
df2

   性别  基本工资   销售业绩  业绩提成=销售业绩x10%
姓名
小明  男  3500  10000           1000
小高  男  4500  15000           1500
小红  女  5000  20000           2000
小张  男  5000   1500           1500

In [194]:
df2.iloc[1:-1, 1:]   # 终止位置取不到

    基本工资   销售业绩  业绩提成=销售业绩x10%
姓名
小高  4500  15000           1500
小红  5000  20000           2000

后面基本和loc是一致的，这里不再细讲